---
type: RebarShapeConstraintSegmentLength
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarShapeConstraintSegmentLength

`Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintSegmentLength | 2012 | `public RebarShapeConstraintSegmentLength ( ElementId paramId , RebarShapeSegmentEndReferenceType refType0 , RebarShapeSegmentEndReferenceType refType1 )` |
| Method | GetSegmentEndReferenceType | 2012 | `public RebarShapeSegmentEndReferenceType GetSegmentEndReferenceType ( int index )` |